===============================================================================
RPC Test Messages for DCC_tester
===============================================================================

This document contains JSON-RPC test messages for testing the RPC functionality
of the DCC_tester firmware. Send these messages via the USB CDC ACM interface.

===============================================================================
1. ECHO TEST
===============================================================================

Test basic RPC connectivity by echoing back the parameters.

Request:
{"method":"echo","params":{"test":"hello","value":123}}

Expected Response:
{"status":"ok","echo":{"test":"hello","value":123}}

-------------------------------------------------------------------------------

Request (empty params):
{"method":"echo","params":{}}

Expected Response:
{"status":"ok","echo":{}}

===============================================================================
2. COMMAND STATION CONTROL
===============================================================================

2.1 Start Command Station (Normal Mode - No Loop)
---------------------------------------------------
Request:
{"method":"command_station_start","params":{}}

Expected Response:
{"status":"ok","message":"Command station started","loop":0}

Note: With loop=0, the command station runs without any test loop.
Use this mode when sending custom packets via RPC commands.

-------------------------------------------------------------------------------

2.2 Start Command Station (Test Loop 1 - Basic Function & Speed)
------------------------------------------------------------------
Request:
{"method":"command_station_start","params":{"loop":1}}

Expected Response:
{"status":"ok","message":"Command station started","loop":1}

Note: Loop 1 tests basic functions and speed control on address 3:
- Set function F0
- Accelerate to speed 42 forward
- Stop
- Clear function F0
- Accelerate to speed 42 reverse
- Stop
- Repeats every ~12 seconds

-------------------------------------------------------------------------------

2.3 Start Command Station (Test Loop 2 - Emergency Stop)
---------------------------------------------------------
Request:
{"method":"command_station_start","params":{"loop":2}}

Expected Response:
{"status":"ok","message":"Command station started","loop":2}

Note: Loop 2 tests emergency stop broadcast on address 3:
- Turn on headlight (F0)
- Accelerate to speed 60 forward
- EMERGENCY STOP (broadcast address 0 - affects all locomotives)
- Resume speed 30 forward
- Normal stop (address 3)
- Turn off headlight
- Repeats every ~15 seconds

The emergency stop uses broadcast address 0, which immediately stops ALL 
locomotives on the track regardless of their individual addresses. This 
demonstrates the difference between a targeted stop and a system-wide 
emergency stop.

-------------------------------------------------------------------------------

2.4 Start Command Station (Test Loop 3 - Speed Ramping)
---------------------------------------------------------
Request:
{"method":"command_station_start","params":{"loop":3}}

Expected Response:
{"status":"ok","message":"Command station started","loop":3}

Note: Loop 3 tests speed ramping on address 10:
- Ramp up speed forward (0 to 126 in steps of 10)
- Ramp down speed forward (126 to 0 in steps of 10)
- Ramp up speed reverse (0 to 126 in steps of 10)
- Ramp down speed reverse (126 to 0 in steps of 10)
- Repeats every ~30 seconds

-------------------------------------------------------------------------------

2.5 Start Command Station (Backwards Compatibility - Boolean)
---------------------------------------------------------------
Request:
{"method":"command_station_start","params":{"loop":true}}

Expected Response:
{"status":"ok","message":"Command station started","loop":1}

Note: For backwards compatibility, boolean true maps to loop 1, false to loop 0.

-------------------------------------------------------------------------------

2.6 Stop Command Station
--------------------------
Request:
{"method":"command_station_stop","params":{}}

Expected Response:
{"status":"ok","message":"Command station stopped"}

===============================================================================
3. DECODER CONTROL
===============================================================================

3.1 Start Decoder
------------------
Request:
{"method":"decoder_start","params":{}}

Expected Response:
{"status":"ok","message":"Decoder started"}

-------------------------------------------------------------------------------

3.2 Stop Decoder
-----------------
Request:
{"method":"decoder_stop","params":{}}

Expected Response:
{"status":"ok","message":"Decoder stopped"}

===============================================================================
4. COMMAND STATION PARAMETERS
===============================================================================

4.1 Set All DCC Parameters
----------------------------
Request:
{"method":"command_station_params","params":{"preamble_bits":17,"bit1_duration":58,"bit0_duration":100,"bidi_enable":true,"trigger_first_bit":false}}

Expected Response:
{"status":"ok","message":"Command station parameters updated"}

-------------------------------------------------------------------------------

4.2 Set Single Parameter (Preamble Bits)
------------------------------------------
Request:
{"method":"command_station_params","params":{"preamble_bits":14}}

Expected Response:
{"status":"ok","message":"Command station parameters updated"}

-------------------------------------------------------------------------------

4.3 Set Single Parameter (Bit1 Duration)
------------------------------------------
Request:
{"method":"command_station_params","params":{"bit1_duration":58}}

Expected Response:
{"status":"ok","message":"Command station parameters updated"}

-------------------------------------------------------------------------------

4.4 Set Single Parameter (Bit0 Duration)
------------------------------------------
Request:
{"method":"command_station_params","params":{"bit0_duration":100}}

Expected Response:
{"status":"ok","message":"Command station parameters updated"}

-------------------------------------------------------------------------------

4.5 Set Single Parameter (BiDi Enable)
----------------------------------------
Request:
{"method":"command_station_params","params":{"bidi_enable":true}}

Expected Response:
{"status":"ok","message":"Command station parameters updated"}

-------------------------------------------------------------------------------

4.6 Set Single Parameter (BiDi Disable)
-----------------------------------------
Request:
{"method":"command_station_params","params":{"bidi_enable":false}}

Expected Response:
{"status":"ok","message":"Command station parameters updated"}

-------------------------------------------------------------------------------

4.7 Set Multiple Parameters
-----------------------------
Request:
{"method":"command_station_params","params":{"preamble_bits":20,"bit1_duration":60}}

Expected Response:
{"status":"ok","message":"Command station parameters updated"}

-------------------------------------------------------------------------------

4.8 Set Single Parameter (Trigger First Bit Enable)
-----------------------------------------------------
Request:
{"method":"command_station_params","params":{"trigger_first_bit":true}}

Expected Response:
{"status":"ok","message":"Command station parameters updated"}

-------------------------------------------------------------------------------

4.9 Set Single Parameter (Trigger First Bit Disable)
------------------------------------------------------
Request:
{"method":"command_station_params","params":{"trigger_first_bit":false}}

Expected Response:
{"status":"ok","message":"Command station parameters updated"}

-------------------------------------------------------------------------------

4.10 Set Single Parameter (Zero Bit Override Mask)
----------------------------------------------------
Request:
{"method":"command_station_params","params":{"zerobit_override_mask":9}}

Expected Response:
{"status":"ok","message":"Command station parameters updated"}

Note: zerobit_override_mask is a 64-bit unsigned integer. 
- Each bit represents a position (LSB to MSB) in the DCC packet (1-64) starting from the first
zero bit following the preamble and progressing forward in tme. 
i.e. 0x0000000000000002 would typically be the MSB of a decoders 8 bit address etc.  
- Set bit = use modified zero bit timing for that position.
- Clear bit = normal data-dependent timing
- Example: 9 (0b1001) = override bits 1 and 4
- Default: 0 (no override)

-------------------------------------------------------------------------------

4.11 Set Zero Bit Override Mask (Binary Example)
--------------------------------------------------
Request:
{"method":"command_station_params","params":{"zerobit_override_mask":1152921504606846977}}

Expected Response:
{"status":"ok","message":"Command station parameters updated"}

Note: Value 1152921504606846977 = 0x1000000000000001
This overrides bit 1 and bit 61, useful for testing long packets.

-------------------------------------------------------------------------------

4.12 Set Single Parameter (Zero Bit Delta)
--------------------------------------------
Request:
{"method":"command_station_params","params":{"zerobit_delta":20}}

Expected Response:
{"status":"ok","message":"Command station parameters updated"}

Note: zerobit_delta is a signed int32_t value in microseconds.
- Adjusts the timing when override mask bits are set
- Can be positive or negative to increase/decrease timing
- Must be less than +/- ~80% of programmed zero bit time to avoid overflow
- Default: 0 microseconds (no adjustment)
- Typical range: -70 to +70 microseconds
/* Caution! to avoid overflow and wraparound zerobitDelta must alway be less than
   approx +-80% of the programmed zero bit time */

===============================================================================
5. PARAMETER FLASH OPERATIONS
===============================================================================

5.1 Save Parameters to Flash
------------------------------
Request:
{"method":"parameters_save","params":{}}

Expected Response:
{"status":"ok","message":"Parameters saved to flash"}

-------------------------------------------------------------------------------

5.2 Restore Parameters from Flash
-----------------------------------
Request:
{"method":"parameters_restore","params":{}}

Expected Response:
{"status":"ok","message":"Parameters restored from flash"}

-------------------------------------------------------------------------------

5.3 Factory Reset (Restore Default Parameters)
------------------------------------------------
Request:
{"method":"parameters_factory_reset","params":{}}

Expected Response:
{"status":"ok","message":"Factory reset completed - all parameters restored to defaults"}

Note: This erases the EDATA flash area and resets all parameters to defaults.

===============================================================================
6. SYSTEM CONTROL
===============================================================================

6.1 System Reboot
------------------
Request:
{"method":"system_reboot","params":{}}

Expected Response:
{"status":"ok","message":"System rebooting..."}

Note: After sending this command, the system will reset. The USB connection 
will be lost briefly. Wait a few seconds and reconnect.

===============================================================================
7. ANALOG FEEDBACK READINGS
===============================================================================

7.1 Get Voltage Feedback
--------------------------
Request:
{"method":"get_voltage_feedback_mv","params":{}}

Expected Response:
{"status":"ok","voltage_mv":15000}

Note: Returns track voltage feedback in millivolts (mV).
- ADC source: ADC1 Channel 6
- Scale factor: 656 mV per ADC count
- Resolution: 12-bit (0-4095 counts)
- Typical range: 0-26,895 mV (0-26.9V)

-------------------------------------------------------------------------------

7.2 Get Current Feedback
--------------------------
Request:
{"method":"get_current_feedback_ma","params":{}}

Expected Response:
{"status":"ok","current_ma":2500}

Note: Returns track current feedback in milliamps (mA).
- ADC source: ADC2 Channel 2
- Scale factor: 0.5 mA per ADC count
- Resolution: 12-bit (0-4095 counts)
- Typical range: 0-2047 mA (0-2.047A)

===============================================================================
8. ERROR CASES
===============================================================================

6.1 Invalid JSON
-----------------
Request:
{invalid json}

Expected Response:
{"status":"error","message":"Invalid JSON"}

-------------------------------------------------------------------------------

6.2 Missing Method Field
--------------------------
Request:
{"params":{}}

Expected Response:
{"status":"error","message":"Malformed request"}

-------------------------------------------------------------------------------

6.3 Missing Params Field
--------------------------
Request:
{"method":"echo"}

Expected Response:
{"status":"error","message":"Malformed request"}

-------------------------------------------------------------------------------

6.4 Unknown Method
-------------------
Request:
{"method":"unknown_method","params":{}}

Expected Response:
{"status":"error","message":"Unknown method"}

-------------------------------------------------------------------------------

6.5 Invalid Parameter Type (preamble_bits)
--------------------------------------------
Request:
{"method":"command_station_params","params":{"preamble_bits":"invalid"}}

Expected Response:
{"status":"error","message":"preamble_bits must be a positive integer"}

-------------------------------------------------------------------------------

6.6 Invalid Parameter Type (bit1_duration)
--------------------------------------------
Request:
{"method":"command_station_params","params":{"bit1_duration":"invalid"}}

Expected Response:
{"status":"error","message":"bit1_duration must be a positive integer"}

-------------------------------------------------------------------------------

6.7 Invalid Parameter Type (bidi_enable)
------------------------------------------
Request:
{"method":"command_station_params","params":{"bidi_enable":"yes"}}

Expected Response:
{"status":"error","message":"bidi_enable must be a boolean"}

-------------------------------------------------------------------------------

6.8 Invalid Params Type (not an object)
-----------------------------------------
Request:
{"method":"command_station_params","params":"invalid"}

Expected Response:
{"status":"error","message":"Params must be an object"}

-------------------------------------------------------------------------------

6.9 Invalid Parameter Type (trigger_first_bit)
------------------------------------------------
Request:
{"method":"command_station_params","params":{"trigger_first_bit":"yes"}}

Expected Response:
{"status":"error","message":"trigger_first_bit must be a boolean"}

===============================================================================
8. TYPICAL USAGE SEQUENCES
===============================================================================

8.1 Initialize and Start Command Station
------------------------------------------
Step 1: Set parameters
{"method":"command_station_params","params":{"preamble_bits":17,"bit1_duration":58,"bit0_duration":100,"bidi_enable":true,"trigger_first_bit":false}}

Step 2: Save to flash
{"method":"parameters_save","params":{}}

Step 3: Start command station
{"method":"command_station_start","params":{"loop":true}}

-------------------------------------------------------------------------------

8.2 Quick Parameter Change Without Flash Save
-----------------------------------------------
Step 1: Update parameter
{"method":"command_station_params","params":{"preamble_bits":14}}

Step 2: Restart command station to apply
{"method":"command_station_stop","params":{}}
{"method":"command_station_start","params":{"loop":true}}

-------------------------------------------------------------------------------

8.3 Monitor Voltage and Current
---------------------------------
Step 1: Start command station
{"method":"command_station_start","params":{"loop":true}}

Step 2: Read voltage feedback
{"method":"get_voltage_feedback_mv","params":{}}

Step 3: Read current feedback
{"method":"get_current_feedback_ma","params":{}}

Step 4: Repeat steps 2-3 as needed for monitoring

-------------------------------------------------------------------------------

8.4 Factory Reset and Reboot
------------------------------
Step 1: Stop running systems
{"method":"command_station_stop","params":{}}
{"method":"decoder_stop","params":{}}

Step 2: Perform factory reset
{"method":"parameters_factory_reset","params":{}}

Step 3: Reboot system
{"method":"system_reboot","params":{}}

-------------------------------------------------------------------------------

8.5 Save and Reboot
--------------------
Step 1: Save current parameters
{"method":"parameters_save","params":{}}

Step 2: Reboot to apply changes
{"method":"system_reboot","params":{}}

===============================================================================
9. TESTING TIPS
===============================================================================

- Use a serial terminal program that supports sending raw text/JSON
- Ensure proper line endings (typically newline/CR+LF)
- Wait for response before sending next command
- Check console output (printf) for additional debug information
- command_station_params does NOT auto-save - use parameters_save explicitly
- Use parameters_save/restore for explicit flash operations
- system_reboot will disconnect USB - wait ~3 seconds before reconnecting
- parameters_factory_reset performs a complete parameter reset to defaults
- Analog feedback readings update every ~100ms from ADC scanning task
- Voltage and current readings are averaged over 4 samples per scan

===============================================================================
10. COMPLETE METHOD LIST
===============================================================================

Available RPC Methods:
1. echo                        - Echo back parameters (test connectivity)
2. command_station_start       - Start DCC command station
3. command_station_stop        - Stop DCC command station
4. command_station_params      - Set DCC parameters (preamble, bit timings, bidi)
5. decoder_start               - Start DCC decoder
6. decoder_stop                - Stop DCC decoder
7. parameters_save             - Save all parameters to flash
8. parameters_restore          - Restore parameters from flash
9. parameters_factory_reset    - Reset all parameters to factory defaults
10. system_reboot              - Reboot the microcontroller
11. get_voltage_feedback_mv    - Get track voltage feedback in millivolts
12. get_current_feedback_ma    - Get track current feedback in milliamps

===============================================================================
END OF DOCUMENT
===============================================================================
TODO:

Add the following:

make_idle_packet
make_reset_packet

make_consist_control_packet
make_advanced_operations_speed_direction_and_functions_packet
make_advanced_operations_restricted_speed_packet
make_advanced_operations_speed_packet

make_speed_and_direction_packet

make_function_group_f4_f0_packet
make_function_group_f8_f5_packet
make_function_group_f12_f9_packet
make_feature_expansion_f20_f13_packet
make_feature_expansion_f28_f21_packet

make_binary_state_short_packet
make_binary_state_long_packet
make_cv_access_long_verify_service_packet
make_cv_access_long_write_service_packet

make_cv_access_short_write_packet
make_cv_access_long_verify_packet
make_cv_access_long_write_packet

make_logon_enable_packet
make_logon_select_packet
make_logon_assign_packet

make_basic_accessory_packet

make_accessory_nop_packet

make arbitary make_idle_packet