===============================================================================
RPC Test Messages for DCC_tester
===============================================================================

This document contains JSON-RPC test messages for testing the RPC functionality
of the DCC_tester firmware. Send these messages via the USB CDC ACM interface.

===============================================================================
1. ECHO TEST
===============================================================================

Test basic RPC connectivity by echoing back the parameters.

Request:
{"method":"echo","params":{"test":"hello","value":123}}

Expected Response:
{"status":"ok","echo":{"test":"hello","value":123}}

-------------------------------------------------------------------------------

Request (empty params):
{"method":"echo","params":{}}

Expected Response:
{"status":"ok","echo":{}}

===============================================================================
2. COMMAND STATION CONTROL
===============================================================================

2.1 Start Command Station (Normal Mode - No Loop)
---------------------------------------------------
Request:
{"method":"command_station_start","params":{}}

Expected Response (on success):
{"status":"ok","message":"Command station started","loop":0}

Expected Response (if already running):
{"status":"error","message":"Command station is already running"}

Note: With loop=0, the command station runs without any test loop.
Use this mode when sending custom packets via RPC commands.

-------------------------------------------------------------------------------

2.2 Start Command Station (Test Loop 1 - Basic Function & Speed)
------------------------------------------------------------------
Request:
{"method":"command_station_start","params":{"loop":1}}

Expected Response (on success):
{"status":"ok","message":"Command station started","loop":1}

Expected Response (if already running):
{"status":"error","message":"Command station is already running"}

Note: Loop 1 tests basic functions and speed control on address 3:
- Set function F0
- Accelerate to speed 42 forward
- Stop
- Clear function F0
- Accelerate to speed 42 reverse
- Stop
- Repeats every ~12 seconds

-------------------------------------------------------------------------------

2.3 Start Command Station (Test Loop 2 - Emergency Stop)
---------------------------------------------------------
Request:
{"method":"command_station_start","params":{"loop":2}}

Expected Response (on success):
{"status":"ok","message":"Command station started","loop":2}

Expected Response (if already running):
{"status":"error","message":"Command station is already running"}

Note: Loop 2 runs a single test sequence then automatically stops:
- Accelerate to speed 60 reverse on address 3
- EMERGENCY STOP (broadcast address 0 - affects all locomotives)
- Turn off headlight (F0)
- Command station automatically stops

The emergency stop uses broadcast address 0, which immediately stops ALL 
locomotives on the track regardless of their individual addresses. This 
demonstrates the difference between a targeted stop and a system-wide 
emergency stop.

-------------------------------------------------------------------------------

2.4 Start Command Station (Test Loop 3 - Speed Ramping)
---------------------------------------------------------
Request:
{"method":"command_station_start","params":{"loop":3}}

Expected Response (on success):
{"status":"ok","message":"Command station started","loop":3}

Expected Response (if already running):
{"status":"error","message":"Command station is already running"}

Note: Loop 3 tests speed ramping on address 10:
- Ramp up speed forward (0 to 126 in steps of 10)
- Ramp down speed forward (126 to 0 in steps of 10)
- Ramp up speed reverse (0 to 126 in steps of 10)
- Ramp down speed reverse (126 to 0 in steps of 10)
- Repeats every ~30 seconds

-------------------------------------------------------------------------------

2.5 Start Command Station (Backwards Compatibility - Boolean)
---------------------------------------------------------------
Request:
{"method":"command_station_start","params":{"loop":true}}

Expected Response:
{"status":"ok","message":"Command station started","loop":1}

Note: For backwards compatibility, boolean true maps to loop 1, false to loop 0.

-------------------------------------------------------------------------------

2.6 Stop Command Station
--------------------------
Request:
{"method":"command_station_stop","params":{}}

Expected Response (on success):
{"status":"ok","message":"Command station stopped"}

Expected Response (if not running):
{"status":"error","message":"Command station is not running"}

===============================================================================
3. DECODER CONTROL
===============================================================================

3.1 Start Decoder
------------------
Request:
{"method":"decoder_start","params":{}}

Expected Response:
{"status":"ok","message":"Decoder started"}

-------------------------------------------------------------------------------

3.2 Stop Decoder
-----------------
Request:
{"method":"decoder_stop","params":{}}

Expected Response:
{"status":"ok","message":"Decoder stopped"}

===============================================================================
4. COMMAND STATION PARAMETERS
Note: command station bit timing values apply to all packets while the command
station is running.
===============================================================================

4.1 Set All DCC Parameters
----------------------------
Request:
{"method":"command_station_params","params":{"preamble_bits":17,"bit1_duration":58,"bit0_duration":100,"bidi_enable":true,"trigger_first_bit":false}}

Expected Response:
{"status":"ok","message":"Command station parameters updated"}

-------------------------------------------------------------------------------

4.2 Set Single Parameter (Preamble Bits)
------------------------------------------
Request:
{"method":"command_station_params","params":{"preamble_bits":14}}

Expected Response:
{"status":"ok","message":"Command station parameters updated"}

-------------------------------------------------------------------------------

4.3 Set Single Parameter (Bit1 Duration)
------------------------------------------
Request:
{"method":"command_station_params","params":{"bit1_duration":58}}

Expected Response:
{"status":"ok","message":"Command station parameters updated"}

-------------------------------------------------------------------------------

4.4 Set Single Parameter (Bit0 Duration)
------------------------------------------
Request:
{"method":"command_station_params","params":{"bit0_duration":100}}

Expected Response:
{"status":"ok","message":"Command station parameters updated"}

-------------------------------------------------------------------------------

4.5 Set Single Parameter (BiDi Enable)
----------------------------------------
Request:
{"method":"command_station_params","params":{"bidi_enable":true}}

Expected Response:
{"status":"ok","message":"Command station parameters updated"}

-------------------------------------------------------------------------------

4.6 Set Single Parameter (BiDi Disable)
-----------------------------------------
Request:
{"method":"command_station_params","params":{"bidi_enable":false}}

Expected Response:
{"status":"ok","message":"Command station parameters updated"}

-------------------------------------------------------------------------------

4.7 Set Multiple Parameters
-----------------------------
Request:
{"method":"command_station_params","params":{"preamble_bits":20,"bit1_duration":60}}

Expected Response:
{"status":"ok","message":"Command station parameters updated"}

-------------------------------------------------------------------------------

4.8 Set Single Parameter (Trigger First Bit Enable)
-----------------------------------------------------
Request:
{"method":"command_station_params","params":{"trigger_first_bit":true}}

Expected Response:
{"status":"ok","message":"Command station parameters updated"}

-------------------------------------------------------------------------------

4.9 Set Single Parameter (Trigger First Bit Disable)
------------------------------------------------------
Request:
{"method":"command_station_params","params":{"trigger_first_bit":false}}

Expected Response:
{"status":"ok","message":"Command station parameters updated"}

===============================================================================
5. PACKET OVERRIDE PARAMETERS (RAM-ONLY)
===============================================================================

Note: Override parameters are RAM-only and NOT saved to flash. They reset to 0
when the command station is stopped or the system is rebooted. Use these 
parameters to temporarily adjust individual zero bit timings for testing.
Note:Packet timing override can only apply to the first 64bits (8 bytes) 
of a packet.

5.1 Set Packet Override Parameters (All at Once)
--------------------------------------------------
Request:
{"method":"command_station_packet_override","params":{"zerobit_override_mask":9,"zerobit_deltaP":20,"zerobit_deltaN":-15}}

Expected Response:
{"status":"ok","message":"Packet override parameters updated"}

Note: These parameters control per-bit timing adjustments for DCC packets.
- zerobit_override_mask: 64-bit mask selecting which zero bits to adjust
- zerobit_deltaP: P phase timing adjustment in microseconds (signed)
- zerobit_deltaN: N phase timing adjustment in microseconds (signed)

-------------------------------------------------------------------------------

5.2 Set Single Parameter (Zero Bit Override Mask)
---------------------------------------------------
Request:
{"method":"command_station_packet_override","params":{"zerobit_override_mask":9}}

Expected Response:
{"status":"ok","message":"Packet override parameters updated"}

Note: zerobit_override_mask is a 64-bit unsigned integer. 
- Each bit represents a position (LSB to MSB) in the DCC packet (1-64) starting from the first
zero bit following the preamble and progressing forward in time. 
i.e. 0x0000000000000002 would typically be the MSB of a decoder's 8 bit address etc.  
- Set bit = use modified zero bit timing for that position.
- Clear bit = normal data-dependent timing
- Example: 9 (0b1001) = override bits 1 and 4
- Default: 0 (no override)

-------------------------------------------------------------------------------

5.3 Set Zero Bit Override Mask (Binary Example)
-------------------------------------------------
Request:
{"method":"command_station_packet_override","params":{"zerobit_override_mask":1152921504606846977}}

Expected Response:
{"status":"ok","message":"Packet override parameters updated"}

Note: Value 1152921504606846977 = 0x1000000000000001
This overrides bit 1 and bit 61, useful for testing long packets.

-------------------------------------------------------------------------------

5.4 Set Single Parameter (Zero Bit Delta P Phase)
---------------------------------------------------
Request:
{"method":"command_station_packet_override","params":{"zerobit_deltaP":20}}

Expected Response:
{"status":"ok","message":"Packet override parameters updated"}

Note: zerobit_deltaP is a signed int32_t value in microseconds.
- Adjusts the P phase timing when override mask bits are set
- Can be positive or negative to increase/decrease timing
- Must be less than +/- ~80% of programmed zero bit time to avoid overflow
- Default: 0 microseconds (no adjustment)
- Typical range: -70 to +70 microseconds
/* Caution! to avoid overflow and wraparound zerobitDeltaP must always be less than
   approx +-80% of the programmed zero bit time */

-------------------------------------------------------------------------------

5.5 Set Single Parameter (Zero Bit Delta N Phase)
---------------------------------------------------
Request:
{"method":"command_station_packet_override","params":{"zerobit_deltaN":-15}}

Expected Response:
{"status":"ok","message":"Packet override parameters updated"}

Note: zerobit_deltaN is a signed int32_t value in microseconds.
- Adjusts the N phase timing when override mask bits are set
- Can be positive or negative to increase/decrease timing
- Must be less than +/- ~80% of programmed zero bit time to avoid overflow
- Default: 0 microseconds (no adjustment)
- Typical range: -70 to +70 microseconds
/* Caution! to avoid overflow and wraparound zerobitDeltaN must always be less than
   approx +-80% of the programmed zero bit time */

-------------------------------------------------------------------------------

5.6 Set Multiple Parameters Including Both Delta Values
---------------------------------------------------------
Request:
{"method":"command_station_packet_override","params":{"zerobit_override_mask":"0x0000000000000180","zerobit_deltaP":25,"zerobit_deltaN":-20}}

Expected Response:
{"status":"ok","message":"Packet override parameters updated"}

Note: This allows independent P and N phase timing adjustments for bits 
specified in the override mask. P phase occurs first, followed by N phase.
These are RAM-only parameters and will NOT be saved by parameters_save.

-------------------------------------------------------------------------------

5.7 Reset Override Parameters to Zero
--------------------------------------
Request:
{"method":"command_station_packet_reset_override","params":{}}

Expected Response:
{"status":"ok","message":"Packet override parameters reset to 0"}

Note: This is a convenience method to reset all override parameters (mask and
both deltas) to 0. Equivalent to calling command_station_packet_override with
all three parameters set to 0.

-------------------------------------------------------------------------------

5.8 Get Current Override Parameters
------------------------------------
Request:
{"method":"command_station_packet_get_override","params":{}}

Expected Response:
{
  "status": "ok",
  "zerobit_override_mask": "0x0000000000000002",
  "zerobit_override_mask_decimal": 2,
  "zerobit_deltaP": 20,
  "zerobit_deltaN": 0
}

Note: Returns the current RAM values of all override parameters.
- zerobit_override_mask: 64-bit mask as hex string
- zerobit_override_mask_decimal: Same mask as decimal number
- zerobit_deltaP: P phase timing delta in microseconds (signed)
- zerobit_deltaN: N phase timing delta in microseconds (signed)

===============================================================================
6. PARAMETER FLASH OPERATIONS
===============================================================================

Note: Override parameters (zerobit_override_mask, zerobit_deltaP, zerobit_deltaN)
are RAM-only and are NOT affected by save/restore/factory_reset operations.
They must be set each time the command station starts if non-zero values are needed.

6.1 Save Parameters to Flash
------------------------------
Request:
{"method":"parameters_save","params":{}}

Expected Response:
{"status":"ok","message":"Parameters saved to flash"}

-------------------------------------------------------------------------------

6.2 Restore Parameters from Flash
-----------------------------------
Request:
{"method":"parameters_restore","params":{}}

Expected Response:
{"status":"ok","message":"Parameters restored from flash"}

-------------------------------------------------------------------------------

6.3 Factory Reset (Restore Default Parameters)
------------------------------------------------
Request:
{"method":"parameters_factory_reset","params":{}}

Expected Response:
{"status":"ok","message":"Factory reset completed - all parameters restored to defaults"}

Note: This erases the EDATA flash area and resets all parameters to defaults.
Override parameters are NOT affected and remain at their current RAM values.

-------------------------------------------------------------------------------

6.4 Get All Command Station Parameters
----------------------------------------
Request:
{"method":"command_station_get_params","params":{}}

Expected Response:
{
  "status": "ok",
  "parameters": {
    "track_voltage": 15000,
    "preamble_bits": 17,
    "bit1_duration": 58,
    "bit0_duration": 100,
    "bidi_enable": false,
    "bidi_dac": 2048,
    "trigger_first_bit": false,
    "zerobit_override_mask": "0x0000000000000000",
    "zerobit_deltaP": 0,
    "zerobit_deltaN": 0
  }
}

Note: This method retrieves all current command station parameter values.
- track_voltage: In millivolts
- preamble_bits: Number of preamble bits (14-20)
- bit1_duration: "1" bit half-period in microseconds (55-61)
- bit0_duration: "0" bit half-period in microseconds (95-9900)
- bidi_enable: BiDi (bidirectional) communication enabled
- bidi_dac: BiDi DAC threshold value (0-4095)
- trigger_first_bit: Trigger output on first bit
- zerobit_override_mask: 64-bit mask (hex string) - RAM-only, not saved to flash
- zerobit_deltaP: P phase timing delta in microseconds (signed) - RAM-only
- zerobit_deltaN: N phase timing delta in microseconds (signed) - RAM-only

Override parameters are read from RAM, not from flash storage.

===============================================================================
7. SYSTEM CONTROL
===============================================================================

6.1 System Reboot
------------------
Request:
{"method":"system_reboot","params":{}}

Expected Response:
{"status":"ok","message":"System rebooting..."}

Note: After sending this command, the system will reset. The USB connection 
will be lost briefly. Wait a few seconds and reconnect.

===============================================================================
8. ANALOG FEEDBACK READINGS
===============================================================================

7.1 Get Voltage Feedback
--------------------------
Request:
{"method":"get_voltage_feedback_mv","params":{}}

Expected Response:
{"status":"ok","voltage_mv":15000}

Note: Returns track voltage feedback in millivolts (mV).
- ADC source: ADC1 Channel 6
- Scale factor: 656 mV per ADC count
- Resolution: 12-bit (0-4095 counts)
- Typical range: 0-26,895 mV (0-26.9V)

-------------------------------------------------------------------------------

7.2 Get Current Feedback
--------------------------
Request:
{"method":"get_current_feedback_ma","params":{}}

Expected Response:
{"status":"ok","current_ma":2500}

Note: Returns track current feedback in milliamps (mA).
- ADC source: ADC2 Channel 2
- Scale factor: 0.5 mA per ADC count
- Resolution: 12-bit (0-4095 counts)
- Typical range: 0-2047 mA (0-2.047A)

===============================================================================
9. ERROR CASES
===============================================================================

9.1 Invalid JSON
-----------------
Request:
{invalid json}

Expected Response:
{"status":"error","message":"Invalid JSON"}

-------------------------------------------------------------------------------

9.2 Missing Method Field
--------------------------
Request:
{"params":{}}

Expected Response:
{"status":"error","message":"Malformed request"}

-------------------------------------------------------------------------------

9.3 Missing Params Field
--------------------------
Request:
{"method":"echo"}

Expected Response:
{"status":"error","message":"Malformed request"}

-------------------------------------------------------------------------------

6.4 Unknown Method
-------------------
Request:
{"method":"unknown_method","params":{}}

Expected Response:
{"status":"error","message":"Unknown method"}

-------------------------------------------------------------------------------

6.5 Invalid Parameter Type (preamble_bits)
--------------------------------------------
Request:
{"method":"command_station_params","params":{"preamble_bits":"invalid"}}

Expected Response:
{"status":"error","message":"preamble_bits must be a positive integer"}

-------------------------------------------------------------------------------

6.6 Invalid Parameter Type (bit1_duration)
--------------------------------------------
Request:
{"method":"command_station_params","params":{"bit1_duration":"invalid"}}

Expected Response:
{"status":"error","message":"bit1_duration must be a positive integer"}

-------------------------------------------------------------------------------

6.7 Invalid Parameter Type (bidi_enable)
------------------------------------------
Request:
{"method":"command_station_params","params":{"bidi_enable":"yes"}}

Expected Response:
{"status":"error","message":"bidi_enable must be a boolean"}

-------------------------------------------------------------------------------

6.8 Invalid Params Type (not an object)
-----------------------------------------
Request:
{"method":"command_station_params","params":"invalid"}

Expected Response:
{"status":"error","message":"Params must be an object"}

-------------------------------------------------------------------------------

6.9 Invalid Parameter Type (trigger_first_bit)
------------------------------------------------
Request:
{"method":"command_station_params","params":{"trigger_first_bit":"yes"}}

Expected Response:
{"status":"error","message":"trigger_first_bit must be a boolean"}

===============================================================================
10. TYPICAL USAGE SEQUENCES
===============================================================================

8.1 Initialize and Start Command Station
------------------------------------------
Step 1: Set parameters
{"method":"command_station_params","params":{"preamble_bits":17,"bit1_duration":58,"bit0_duration":100,"bidi_enable":true,"trigger_first_bit":false}}

Step 2: Save to flash
{"method":"parameters_save","params":{}}

Step 3: Start command station
{"method":"command_station_start","params":{"loop":true}}

-------------------------------------------------------------------------------

8.2 Quick Parameter Change Without Flash Save
-----------------------------------------------
Step 1: Update parameter
{"method":"command_station_params","params":{"preamble_bits":14}}

Step 2: Restart command station to apply
{"method":"command_station_stop","params":{}}
{"method":"command_station_start","params":{"loop":true}}

-------------------------------------------------------------------------------

8.3 Monitor Voltage and Current
---------------------------------
Step 1: Start command station
{"method":"command_station_start","params":{"loop":true}}

Step 2: Read voltage feedback
{"method":"get_voltage_feedback_mv","params":{}}

Step 3: Read current feedback
{"method":"get_current_feedback_ma","params":{}}

Step 4: Repeat steps 2-3 as needed for monitoring

-------------------------------------------------------------------------------

8.4 Factory Reset and Reboot
------------------------------
Step 1: Stop running systems
{"method":"command_station_stop","params":{}}
{"method":"decoder_stop","params":{}}

Step 2: Perform factory reset
{"method":"parameters_factory_reset","params":{}}

Step 3: Reboot system
{"method":"system_reboot","params":{}}

-------------------------------------------------------------------------------

8.5 Save and Reboot
--------------------
Step 1: Save current parameters
{"method":"parameters_save","params":{}}

Step 2: Reboot to apply changes
{"method":"system_reboot","params":{}}

===============================================================================
11. TESTING TIPS
===============================================================================

- Use a serial terminal program that supports sending raw text/JSON
- Ensure proper line endings (typically newline/CR+LF)
- Wait for response before sending next command
- Check console output (printf) for additional debug information
- command_station_params does NOT auto-save - use parameters_save explicitly
- Use parameters_save/restore for explicit flash operations
- system_reboot will disconnect USB - wait ~3 seconds before reconnecting
- parameters_factory_reset performs a complete parameter reset to defaults
- Analog feedback readings update every ~100ms from ADC scanning task
- Voltage and current readings are averaged over 4 samples per scan

===============================================================================
12. CUSTOM PACKET INJECTION
===============================================================================

The command station supports loading and transmitting arbitrary DCC packets
when running in custom packet mode (loop=0). This allows full control over
DCC packet generation for testing and debugging.

10.1 Load Custom Packet
------------------------
Load an arbitrary byte array into the custom packet buffer. Bytes must be
in the range 0-255, and packet length is limited to DCC_MAX_PACKET_SIZE (64).

Request:
{"method":"command_station_load_packet","params":{"bytes":[0xFF,0x00,0xFF]}}

Expected Response:
{"status":"ok","message":"Packet loaded successfully","length":3}

Error Response (invalid byte value):
{"status":"error","message":"Invalid byte value at index 1"}

Error Response (packet too long):
{"status":"error","message":"Packet too long (max 18 bytes)"}

-------------------------------------------------------------------------------

10.2 Trigger Packet Transmission (Default - Single, 100ms delay)
-----------------------------------------------------------------
Trigger transmission of the loaded custom packet. By default, transmits once
with 100ms delay (which only applies if count > 1).

Request:
{"method":"command_station_transmit_packet","params":{}}

Expected Response:
{"status":"ok","message":"Packet transmission triggered","count":1,"delay_ms":100}

-------------------------------------------------------------------------------

10.3 Trigger Packet Transmission (Multiple Times)
---------------------------------------------------
Transmit the loaded packet multiple times with default 100ms delay between
each transmission.

Request:
{"method":"command_station_transmit_packet","params":{"count":5}}

Expected Response:
{"status":"ok","message":"Packet transmission triggered","count":5,"delay_ms":100}

-------------------------------------------------------------------------------

10.4 Trigger Packet Transmission (Custom Delay)
-------------------------------------------------
Transmit multiple times with a specified delay in milliseconds between each
transmission.

Request:
{"method":"command_station_transmit_packet","params":{"count":10,"delay_ms":500}}

Expected Response:
{"status":"ok","message":"Packet transmission triggered","count":10,"delay_ms":500}

Note: The delay parameter directly maps to osDelay() in the RTOS.

-------------------------------------------------------------------------------

10.5 Trigger Packet Transmission (No Delay)
---------------------------------------------
Transmit multiple times with no delay between transmissions.

Request:
{"method":"command_station_transmit_packet","params":{"count":5,"delay_ms":0}}

Expected Response:
{"status":"ok","message":"Packet transmission triggered","count":5,"delay_ms":0}

-------------------------------------------------------------------------------

10.6 Complete Custom Packet Workflow Example
----------------------------------------------
1. Start command station in custom packet mode (loop=0):
   {"method":"command_station_start","params":{"loop":0}}

2. Load a DCC idle packet (address 255, idle instruction, checksum):
   {"method":"command_station_load_packet","params":{"bytes":[0xFF,0x00,0xFF]}}

3. Trigger transmission 3 times with 200ms between each:
   {"method":"command_station_transmit_packet","params":{"count":3,"delay_ms":200}}

The console will show:
Custom packet transmitted [1/3]: 0xFF 0x00 0xFF
Custom packet transmitted [2/3]: 0xFF 0x00 0xFF
Custom packet transmitted [3/3]: 0xFF 0x00 0xFF

===============================================================================
13. COMPLETE METHOD LIST
===============================================================================

Available RPC Methods:
1. echo                                  - Echo back parameters (test connectivity)
2. command_station_start                 - Start DCC command station
3. command_station_stop                  - Stop DCC command station
4. command_station_params                - Set DCC parameters (preamble, bit timings, bidi, trigger)
5. command_station_packet_override       - Set packet override parameters (zero bit mask and deltas)
6. command_station_packet_reset_override - Reset override parameters to 0 (RAM-only)
7. command_station_packet_get_override   - Get current override parameters (RAM-only)
8. command_station_get_params            - Get all current DCC parameters
9. command_station_load_packet           - Load arbitrary byte array into custom packet
10. command_station_transmit_packet      - Trigger transmission of loaded custom packet
11. decoder_start                        - Start DCC decoder
12. decoder_stop                         - Stop DCC decoder
13. parameters_save                      - Save all parameters to flash (excludes override params)
14. parameters_restore                   - Restore parameters from flash (excludes override params)
15. parameters_factory_reset             - Reset all parameters to factory defaults (excludes override params)
16. system_reboot                        - Reboot the microcontroller
17. get_voltage_feedback_mv              - Get track voltage feedback in millivolts
18. get_current_feedback_ma              - Get track current feedback in milliamps

===============================================================================
END OF DOCUMENT
===============================================================================
TODO:

Add the following:

make_idle_packet
make_reset_packet

make_consist_control_packet
make_advanced_operations_speed_direction_and_functions_packet
make_advanced_operations_restricted_speed_packet
make_advanced_operations_speed_packet

make_speed_and_direction_packet

make_function_group_f4_f0_packet
make_function_group_f8_f5_packet
make_function_group_f12_f9_packet
make_feature_expansion_f20_f13_packet
make_feature_expansion_f28_f21_packet

make_binary_state_short_packet
make_binary_state_long_packet
make_cv_access_long_verify_service_packet
make_cv_access_long_write_service_packet

make_cv_access_short_write_packet
make_cv_access_long_verify_packet
make_cv_access_long_write_packet

make_logon_enable_packet
make_logon_select_packet
make_logon_assign_packet

make_basic_accessory_packet

make_accessory_nop_packet

make arbitary make_idle_packet